app/views/posts/index.html.erb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---

<%= User.last.name %>