app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params.require(:user).permit(:name, :email, :password))
    if @user.save